/*
给你一个整数n，请你在无限的整数序列[1,2,3,4,5,6,7,8,9,10,11,...]中找出并返回第n位上的数字。

示例1：
输入：n = 3
输出：3

示例2：
输入：n = 11
输出：0
解释：第11位数字在序列1,2,3,4,5,6,7,8,9,10,11,...里是0，它是10的一部分。

提示：1 <= n <= 2^31 - 1
*/

// 具体规律为,
// 数字区间 [1,9], [10, 99], [100, 999],
// 数字个数  9*1    90*2     900*3
// 数字起始  1      10       100

int findNthDigit(int n) {
  int idx = 1;
  long base = 9;

  // 将n逐渐减小, 每次相减为9,90,900,...
  while (n > idx * base) {
    n -= idx * base;
    base *= 10;
    idx++;
  }
  n--;
  int cnt = n / idx;  // 求距离1,10,100,1000...的距离
  int res = n % idx;  // 求出对应数字的对应位数

  char str[12];  // 输出到字符串,并输出对应位置的数字
  sprintf(str, "%d", base / 9 + cnt);

  return str[res] - '0';
}